02_openfoam_cfd/source_package/gaganyaan_openfoam_v3_3d_canopy_research/cases/04_main_reef2_3D/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-154.91933 -154.91933 -154.91933)
    (387.29833 -154.91933 -154.91933)
    (387.29833 154.91933 -154.91933)
    (-154.91933 154.91933 -154.91933)
    (-154.91933 -154.91933 154.91933)
    (387.29833 -154.91933 154.91933)
    (387.29833 154.91933 154.91933)
    (-154.91933 154.91933 154.91933)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (72 36 36) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    farField
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
