02_openfoam_cfd/source_package/gaganyaan_openfoam_v3_3d_canopy_research/cases/04_main_reef2_3D/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType RAS;
RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}
