02_openfoam_cfd/source_package/gaganyaan_openfoam_v3_3d_canopy_research/cases/04_main_reef2_3D/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 4.61880215352;
boundaryField
{
    inlet { type fixedValue; value uniform 4.61880215352; }
    outlet { type zeroGradient; }
    farField { type zeroGradient; }
    canopy { type omegaWallFunction; value uniform 4.61880215352; }
}
